In [1]:
from pandas import Series, DataFrame ,to_datetime

In [2]:
index = range(6)
date = Series([ '2000-01-03','2000-01-04','2000-01-05','2000-01-03','2000-01-04','2000-01-05'], index=index)
variable = Series(['A','A','A','B','B','B'],index=index)
value = Series([0.469112,-0.282863, -1.509059, -1.135632, 1.212112, -0.173215] , index=index)

In [3]:
# convert to date 
date = to_datetime(date)

In [4]:
d = {'date':date, 'variable':variable, 'value':value}
df = DataFrame(d)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
date        6 non-null datetime64[ns]
value       6 non-null float64
variable    6 non-null object
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 224.0+ bytes

In [5]:
df

        date     value variable
0 2000-01-03  0.469112        A
1 2000-01-04 -0.282863        A
2 2000-01-05 -1.509059        A
3 2000-01-03 -1.135632        B
4 2000-01-04  1.212112        B
5 2000-01-05 -0.173215        B

In [6]:
df.pivot(index='date',columns='variable', values='value')

variable           A         B
date
2000-01-03  0.469112 -1.135632
2000-01-04 -0.282863  1.212112
2000-01-05 -1.509059 -0.173215

In [7]:
import pandas as pd
import numpy as np

In [8]:
data = pd.read_csv('pivot.csv')

In [9]:
print(data)

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [10]:
table= data.pivot_table(index=['A', 'B'], columns=['C'], values='D', aggfunc=np.sum)

In [11]:
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0